#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-08-03 10:56:12.36666906 +0000 UTC]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001]
azurerm_mssql_server.sql-server: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Sql/servers/sql-noplan-dev-001]
azurerm_key_vault.vault: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.KeyVault/vaults/kv-noplan-dev-001]
azurerm_log_analytics_workspace.appinsights-workspace: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourcegroups/rg-noplan-dev-001/providers/microsoft.operationalinsights/workspaces/log-noplan-dev-001]
azurerm_user_assigned_identity.id: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/id-noplan-dev-westeurope-001]
azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001]
azurerm_mssql_database.noplan: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Sql/servers/sql-noplan-dev-001/databases/noplan]
azurerm_app_configuration.app-config: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.AppConfiguration/configurationStores/appcs-noplan-dev]
azurerm_role_assignment.uami-secrets-user-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.KeyVault/vaults/kv-noplan-dev-001/providers/Microsoft.Authorization/roleAssignments/c23c1c35-f6ce-44e5-b6f9-d4d16c6ab599]
azurerm_role_assignment.dev-group-secrets-administrator-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.KeyVault/vaults/kv-noplan-dev-001/providers/Microsoft.Authorization/roleAssignments/df50f6dc-6bdd-45c8-9fc6-c23156c8dfd4]
azurerm_role_assignment.uami-acrpull-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001/providers/Microsoft.Authorization/roleAssignments/511c324b-ea6e-43d4-94df-76e3832ac7ce]
azurerm_role_assignment.github-actions-acrpush-role: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001/providers/Microsoft.Authorization/roleAssignments/a4684096-994c-419f-a88e-481ca3463651]
azurerm_application_insights.appinsights: Refreshing state... [id=/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/microsoft.insights/components/appi-noplan-dev-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_mssql_server.sql-server will be updated in-place
  ~ resource "azurerm_mssql_server" "sql-server" {
        id                                   = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.Sql/servers/sql-noplan-dev-001"
      + minimum_tls_version                  = "1.2"
        name                                 = "sql-noplan-dev-001"
        tags                                 = {
            "environment" = "dev"
            "project"     = "noplan"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_role_assignment.uami-acrpull-role must be replaced
-/+ resource "azurerm_role_assignment" "uami-acrpull-role" {
      ~ id                               = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001/providers/Microsoft.Authorization/roleAssignments/511c324b-ea6e-43d4-94df-76e3832ac7ce" -> (known after apply)
      ~ name                             = "511c324b-ea6e-43d4-94df-76e3832ac7ce" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      ~ scope                            = "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourcegroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001" -> "/subscriptions/16e01a00-f825-4c96-8ae2-e68cb52cf653/resourceGroups/rg-noplan-dev-001/providers/Microsoft.ContainerRegistry/registries/crnoplandev001" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

      *Pushed by: @ThorstenSauter, Action: `pull_request`*